# ExternalGeometryId Operators

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalGeometryId Operators
ExternalGeometryId Class See Also
---
The ExternalGeometryId type exposes the following members.
# Operators
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equality | Determines whether two ExternalGeometryIds are the same. |
| Inequality | Determines whether two ExternalGeometryIds are different. |

# See Also
ExternalGeometryId Class
Autodesk.Revit.DB Namespace